In [65]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [66]:
s = pd.Series(["Zainab", "Farah", "Manar"], index=[1, 2, 3])
s

1    Zainab
2     Farah
3     Manar
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [67]:
s.index=[11, 12, 13]
s

11    Zainab
12     Farah
13     Manar
dtype: object

## Q3: Retrieve First and second elements.

In [68]:
s[:2]

11    Zainab
12     Farah
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [69]:
s = s.append(pd.Series({14: 'Soha', 15: 'Farah'}))
s

C:\Users\zainab\AppData\Local\Temp\ipykernel_14956\1455640243.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s = s.append(pd.Series({14: 'Soha', 15: 'Farah'}))

11    Zainab
12     Farah
13     Manar
14      Soha
15     Farah
dtype: object

In [70]:
s = s.drop_duplicates()
s

11    Zainab
12     Farah
13     Manar
14      Soha
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [71]:
Students = pd.DataFrame(columns=['ID', 'Name', 'GPA'])
Students

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [72]:
eduData = pd.read_csv(r"C:\Users\zainab\Desktop\DS_Bootcamp\Lectures\6-pandas\educ_figdp_1_Data.csv",)
eduData

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [73]:
eduData.loc[15:20, ['TIME', 'GEO']]  #with loc i can specify the locations and the columns if i want, and all of them will be included

    TIME                            GEO
15  2003  European Union (27 countries)
16  2004  European Union (27 countries)
17  2005  European Union (27 countries)
18  2006  European Union (27 countries)
19  2007  European Union (27 countries)
20  2008  European Union (27 countries)

In [74]:
eduData[15:20] #with slicing i treat them like a numpy arrays, the last number not included

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
16,2004,European Union (27 countries),Total public expenditure on education as % of ...,4.95,e
17,2005,European Union (27 countries),Total public expenditure on education as % of ...,4.92,e
18,2006,European Union (27 countries),Total public expenditure on education as % of ...,4.91,e
19,2007,European Union (27 countries),Total public expenditure on education as % of ...,4.93,e